import random

""" 고객번호, 계량기번호, 검침일 등의 가데이터 생성기 """

# 고객, 계량기 번호
# r = set(str(random.random())[2:13] for _ in range(100))
# print(*list(r)[:71],sep="\n")

# 검침일
# print(*[int(random.random() * 100) % 30 + 1 for _ in range(100)][:71], sep="\n")

# 계약전력
# print(*(random.randint(8,100) for _ in range(71)), sep="\n")
res = (11, 80, 46, 30, 43, 70, 74, 72, 13, 82, 79, 75, 13, 31, 54, 43, 46, 70, 8, 60, 42, 53, 22, 25, 21, 10, 87, 38, 30, 34, 21, 86, 55, 22, 36, 76, 87, 36, 39, 82, 87, 84, 22, 57, 69, 72, 72, 31, 30, 46, 33, 81, 54, 20, 20, 82, 11, 25, 32, 95, 42, 10, 81, 42, 28, 56, 27, 61, 30, 76, 18)

# 최대수요전력
print(*(r+ random.randint(-10,10) for r in res), sep="\n")