from public_building_dat import PUBLIC_BUILDINGS


def main():
    with open("constants/energy_usage_rowdata.dat", "r") as f:
        for r in f.readlines():
            if "서울특별시" in r:
                cols = r.strip("\n").split("\t")
                pnu = "".join(cols[1:3])+"1"+"".join(cols[4:6])
                if pnu in pnu_map:
                    li.append([pnu_map[pnu], cols[6], cols[-1]])
    
    with open("constants/energy_usage_rowdata_1.dat", "w") as f:
        for r in li:
            print(r)
            f.write("\t".join((str(name_map[r[0]]), r[1], r[2]))+"\n")


if __name__ == "__main__":
    li = []
    name_map = dict(
        [[e["name"].replace(" ", ""), i] for i, e in enumerate(PUBLIC_BUILDINGS)]
    )
    pnu_map = {
        #  116804166357
        "1168011200106280000": "자곡문화센터",
        "1168010300112710000": "구민체육관",
        "1168010300100130001": "대진체육관",
        "1168011500107180000": "강남스포츠문화센터",
        "1168011800102040000": "매봉산실내배드민턴장",
        "1168010400101240001": "청담문화센터",
        "1168010300100120006": "개포3동주민센터",
        "1168010300100120010": "강남장애인복지관",
        "1168011400107120003": "일원1동주민센터",
        "1168011400107350003": "일원본동주민센터",
        "1168010100107610026": "역삼2문화센터",
        "1168010100108290020": "역삼1문화센터",
        "1168010100107890011": "강남취창업허브센터",
        "1168011000104580000": "압구정동주민센터",
        "1168011000104830000": "아람어린이집",
        "1168010700105480001": "신사동주민센터",
        "1168011500107210000": "강남세움센터",
        "1168011500107180002": "수서동주민센터",
        "1168011300102780001": "세곡동주민센터",
        "1168010500100080000": "강남구보건소",
        "1168010500101610002": "삼성1문화센터",
        "1168011800104590000": "도곡2문화센터",
        "1168011800108920006": "도곡정보문화도서관",
        "1168010600109280022": "대치4문화센터",
        "1168010600109800009": "대치2문화센터",
        "1168010600106460002": "대치1문화센터",
        "1168010800101140024": "논현2동주민센터",
        "1168010300112110004": "강남지역자활센터+강남구어린이급식관리지원센터",
        "1168010300112040000": "개포4문화센터",
        "1168010300101820000": "개포2문화센터",
        "1168010500100160001": "강남구청사(본관)",
        "1168010500100660000": "강남구청삼성로별관",
        "1168010400100940004": "청담경로당",
        "1168010400100160016": "재너머경로당",
        "1168010400101120026": "청수경로당",
        "1168010300100140002": "목련데이케어센터",
        "1168011400107300000": "일원경로당",
        "1168010100107810034": "구립역삼데이케어센터",
        "1168010100107600003": "역삼재가노인데이케어센터",
        "1168010100107950025": "역삼중앙경로당",
        "1168010100107520011": "하방교경로당",
        "1168010100107390015": "역삼제3경로당",
        "1168010100106830019": "선정경로당",
        "1168010100106820008": "강남시니어플라자",
        "1168010100106720019": "테헤란경로당",
        "1168010100106320013": "상방교경로당",
        "1168010700106520013": "압구정데이케어센터",
        "1168010700106270002": "압구정1동경로당",
        "1168010700105440029": "학수정데이케어센터",
        "1168011500107070001": "수서3단지아파트경로당",
        "1168011500104710011": "궁마을경로당",
        "1168011300103080015": "방죽1경로당",
        "1168011300102010019": "방죽2경로당",
        "1168011100105210001": "세곡데이케어센터",
        "1168011100101280013": "반고개경로당",
        "1168010500101230029": "봉전경로당",
        "1168011800104550000": "도곡경로당",
        "1168011800109500010": "도곡1동경로당",
        "1168010600109290010": "대치4경로당",
        "1168010600109010004": "구립대치데이케어센터",
        "1168010600108990025": "한티경로당",
        "1168010800100800011": "강남논현데이케어센터",
        "1168010800102630023": "영동경로당",
        "1168010800101890010": "강남구립세심정데이케어센터",
        "1168010800101500005": "논현경로당",
        "1168010800101250013": "논현노인종합복지관",
        "1168010300112650004": "밀미리경로당",
        "1168010300112200000": "포이경로당",
        "1168010300101690003": "개포경로당",
        "1168010300101810000": "이화경로당",
    }
    main()
